INSERT INTO etf_transaction (etf_id, isa_account_id, transaction_type, quantity, price, transaction_at) VALUES
-- 2025년 1월 데이터 (추가 BUY)
(1, 6, 'BUY', 28.000000, 10020.00, '2025-01-02 10:00:00'),
(26, 6, 'BUY', 27.000000, 32010.00, '2025-01-02 11:00:00'),
(40, 6, 'BUY', 32.000000, 32215.00, '2025-01-02 10:30:00'),
(318, 6, 'BUY', 22.000000, 10095.00, '2025-01-02 09:30:00'),
(353, 6, 'BUY', 42.000000, 12135.00, '2025-01-02 11:30:00');

INSERT INTO etf_transaction (etf_id, isa_account_id, transaction_type, quantity, price, transaction_at) VALUES
-- 2025년 2월 데이터 (추가 BUY, SELL)
(1, 6, 'BUY', 15.000000, 9390.00, '2025-02-03 09:45:00'),
(26, 6, 'SELL', 10.000000, 32650.00, '2025-02-03 10:30:00'),
(40, 6, 'BUY', 20.000000, 32900.00, '2025-02-03 11:15:00'),
(318, 6, 'SELL', 8.000000, 10400.00, '2025-02-03 14:20:00'),
(353, 6, 'BUY', 25.000000, 13320.00, '2025-02-03 15:30:00');

INSERT INTO etf_transaction (etf_id, isa_account_id, transaction_type, quantity, price, transaction_at) VALUES
-- 2025년 3월 데이터 (추가 BUY, SELL)
(1, 6, 'BUY', 15.000000, 9390.00, '2025-03-03 09:45:00'),
(26, 6, 'SELL', 10.000000, 33904.00, '2025-03-03 10:30:00'),
(40, 6, 'SELL', 20.000000, 34210.00, '2025-03-03 11:15:00'),
(353, 6, 'BUY', 15.000000, 12970.00, '2025-03-03 15:30:00');

INSERT INTO etf_transaction (etf_id, isa_account_id, transaction_type, quantity, price, transaction_at) VALUES
-- 2025년 4월 데이터 (추가 BUY, SELL)
(197, 6, 'BUY', 25.000000, 40500.00, '2025-04-01 09:45:00'),
(295, 6, 'BUY', 30.000000, 13090.00, '2025-04-01 09:45:00'),
(353, 6, 'SELL', 10.000000, 13320.00, '2025-04-01 10:30:00')
;

INSERT INTO etf_transaction (etf_id, isa_account_id, transaction_type, quantity, price, transaction_at) VALUES
-- 2025년 5월 데이터 (추가 BUY, SELL)
(26, 6, 'BUY', 10.000000, 34440.00, '2025-05-12 09:45:00'),
(197, 6, 'SELL', 15.000000, 47812.00, '2025-05-13 09:45:00'),
(295, 6, 'SELL', 10.000000, 13125.00, '2025-05-22 12:43:00'),
(353, 6, 'BUY', 10.000000, 12760.00, '2025-05-27 10:30:00')
;

INSERT INTO etf_transaction (etf_id, isa_account_id, transaction_type, quantity, price, transaction_at) VALUES
-- 2025년 6월 데이터 (추가 BUY, SELL)
(1, 6, 'BUY', 10.000000, 8855.00, '2025-06-04 09:45:00'),
(26, 6, 'BUY', 28.000000, 39640.00, '2025-06-18 09:45:00'),
(197, 6, 'SELL', 5.000000, 49915.00, '2025-06-18 09:45:00'),
(295, 6, 'SELL', 10.000000, 13125.00, '2025-06-09 12:43:00'),
(318, 6, 'SELL', 14.000000, 12500.00, '2025-06-05 10:30:00'),
(353, 6, 'BUY', 10.000000, 13900.00, '2025-06-16 10:30:00')
;
